#### ConcreteCompression Property

---

|  |
| --- |
| StructuralAsset Class   See Also |

The compression strength of concrete-based assets.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public double ConcreteCompression { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property ConcreteCompression As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double ConcreteCompression { 	double get (); 	void set (double value); } ``` |

# Remarks

Applies to concrete-based structural assets. The value is in Newtons per foot meter (N/(ft Â· m)).

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions InapplicableDataException | When setting this property: the material type must be concrete to set this property. |

# See Also

StructuralAsset Class

Autodesk.Revit.DB Namespace